# Modifying Dataframe and Renaming Labels

In [5]:
import numpy as np
import pandas as pd

In [6]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti'] 
article = [210, 211, 114, 178] 
  
auth_series = pd.Series(author) 
article_series = pd.Series(article) 
  
frame = { 'Author': auth_series, 'Article': article_series } 
  
result = pd.DataFrame(frame)
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [7]:
# Modifying the whole column value
result['Article'] = 22

In [8]:
result

     Author  Article
0  Jitender       22
1   Purnima       22
2     Arpit       22
3     Jyoti       22

In [12]:
result.rename(columns={'Author':'Writer'},index={0:'row'})

       Writer  Article
row  Jitender       22
1     Purnima       22
2       Arpit       22
3       Jyoti       22

In [ ]:
result